docs/1c-export-2026-06-02/InformationRegisters/Сектори.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>Сектори</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сектор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сектори</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

docs/1c-export-2026-06-02/Documents/РучнаЗмінаСектора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>РучнаЗмінаСектора</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Сектори</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сектор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сектори</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Відповідальний</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

docs/1c-export-2026-06-02/CommonModules/ОблікСекторів/Ext/Module.bsl
Функция ОтриматиСектор(НазваСектора) Экспорт 
	Если ТипЗнч(НазваСектора)= Тип("СправочникСсылка.Сектори") Тогда 
		Возврат НазваСектора;
	КонецЕсли;
	
	ЗнайдСектор = Справочники.Сектори.НайтиПоКоду(СокрЛП(НазваСектора));
	Если ЗнайдСектор.Пустая() Тогда 
		НовСпр = Справочники.Сектори.СоздатьЭлемент();
		НовСпр.Код =  СокрЛП(НазваСектора);
		НовСпр.Записать();
		ЗнайдСектор = НовСпр.Ссылка;
	КонецЕсли;
	Возврат ЗнайдСектор;
КонецФункции

Процедура РучнаЗмінаСектораНаСкладі(ХарактеристикиНоменклатуры, Сектор)     Экспорт 
	
	з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ
	|	СекториСрезПоследних.Сектор
	|ИЗ
	|	РегистрСведений.Сектори.СрезПоследних КАК СекториСрезПоследних
	|ГДЕ
	|	СекториСрезПоследних.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры";
	з.УстановитьПараметр("ХарактеристикаНоменклатуры", ХарактеристикиНоменклатуры);
	Выборка = з.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Если Выборка.Сектор = Сектор Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	
	
	ДокОб = Документы.РучнаЗмінаСектора.СоздатьДокумент();
	ДокОб.Дата = ТекущаяДата();
	ДокОб.ХарактеристикаНоменклатуры = ХарактеристикиНоменклатуры;
	ДокОб.Сектор = Сектор;
	ДокОб.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
	
КонецПроцедуры
